In [4]:
import pandas as pd
india_weather=pd.DataFrame({
    "city": ["hyderabad","mumbai","chennai"],
    "temperature": [27,32,23],
    "humidity": [12,33,42]
})
Us_weather=pd.DataFrame({
    "city": ["california","new York","Austin"],
    "temperature": [26,31,28],
    "humidity": [10,30,47]
})

In [5]:
india_weather

        city  temperature  humidity
0  hyderabad           27        12
1     mumbai           32        33
2    chennai           23        42

In [6]:
Us_weather

         city  temperature  humidity
0  california           26        10
1    new York           31        30
2      Austin           28        47

In [8]:

df=pd.concat([india_weather,Us_weather],ignore_index=True)
df

         city  temperature  humidity
0   hyderabad           27        12
1      mumbai           32        33
2     chennai           23        42
3  california           26        10
4    new York           31        30
5      Austin           28        47

In [10]:
temperature=pd.DataFrame({
    "city": ["hyderabad","mumbai","chennai"],
    "temperature": [27,32,23]})
temperature

        city  temperature
0  hyderabad           27
1     mumbai           32
2    chennai           23

In [11]:
humidity=pd.DataFrame({
    "city": ["hyderabad","mumbai","chennai"],
       "humidity": [12,33,42]
    })
humidity

        city  humidity
0  hyderabad        12
1     mumbai        33
2    chennai        42

In [12]:
pd.concat([temperature,humidity],axis=1)

        city  temperature       city  humidity
0  hyderabad           27  hyderabad        12
1     mumbai           32     mumbai        33
2    chennai           23    chennai        42

In [16]:
temperature=pd.DataFrame({
    "city": ["hyderabad","mumbai","chennai"],
    "temperature": [27,32,23]})
temperature

        city  temperature
0  hyderabad           27
1     mumbai           32
2    chennai           23

In [15]:
humidity=pd.DataFrame({
    "city": ["mumbai","chennai"],
       "humidity": [33,42]
    })
humidity

      city  humidity
0   mumbai        33
1  chennai        42

In [17]:
pd.concat([temperature,humidity],axis=1)

        city  temperature     city  humidity
0  hyderabad           27   mumbai      33.0
1     mumbai           32  chennai      42.0
2    chennai           23      NaN       NaN

In [18]:
temperature=pd.DataFrame({
    "city": ["hyderabad","mumbai","chennai"],
    "temperature": [27,32,23]},index=[0,1,2])
temperature

        city  temperature
0  hyderabad           27
1     mumbai           32
2    chennai           23

In [19]:
humidity=pd.DataFrame({
    "city": ["mumbai","chennai"],
       "humidity": [33,42]
    },index=[1,2])
humidity

      city  humidity
1   mumbai        33
2  chennai        42

In [25]:
pd.concat([temperature,humidity],axis=1)

        city  temperature     city  humidity
0  hyderabad           27      NaN       NaN
1     mumbai           32   mumbai      33.0
2    chennai           23  chennai      42.0